Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1, 6000, 3)] 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1, 6000, 64)  832         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1, 6000, 64)  16448       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 1, 3000, 64)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1, 3000, 128) 32896       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 1, 3000, 128) 65664       conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 1500, 128) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1, 1500, 256) 131328      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 1500, 256) 262400      conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 1, 750, 256)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 1, 750, 512)  524800      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 750, 512)  1049088     conv2d_6[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1, 750, 512)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 375, 512)  0           dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 375, 1024) 2098176     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 1, 375, 1024) 4195328     conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1, 375, 1024) 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 1, 750, 1024) 0           dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 1, 750, 512)  2097664     up_sampling2d[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1, 750, 1024) 0           dropout[0][0]                    
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 1, 750, 512)  2097664     concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 1, 750, 512)  1049088     conv2d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 1, 1500, 512) 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1, 1500, 256) 524544      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 1500, 512) 0           conv2d_5[0][0]                   
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 1, 1500, 256) 524544      concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 1, 1500, 256) 262400      conv2d_14[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 1, 3000, 256) 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 1, 3000, 128) 131200      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1, 3000, 256) 0           conv2d_3[0][0]                   
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 1, 3000, 128) 131200      concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 1, 3000, 128) 65664       conv2d_17[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 1, 6000, 128) 0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 1, 6000, 64)  32832       up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1, 6000, 128) 0           conv2d_1[0][0]                   
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 1, 6000, 64)  32832       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 1, 6000, 64)  16448       conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 1, 6000, 2)   514         conv2d_21[0][0]                  
__________________________________________________________________________________________________
flatten (Flatten)               (None, 12000)        0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         12289024    flatten[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1024)         0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 101)          103525      dropout_2[0][0]                  
==================================================================================================
Total params: 27,736,103
Trainable params: 27,736,103
Non-trainable params: 0
__________________________________________________________________________________________________
model info save COMPLETE!
Total data number is 101437, Data processing took 0:00:41.
learning rate = 0.0001 epoch = 20
Learning started. It takes sometime.
Epoch: 1 loss = 0.71823663 train accuracy = 0.8422 test accuracy = 0.8635 train MAE = 4.4527km test MAE = 3.7891km
Epoch: 2 loss = 0.67441756 train accuracy = 0.8730 test accuracy = 0.8707 train MAE = 3.4684km test MAE = 3.5964km
Epoch: 3 loss = 0.65187043 train accuracy = 0.8862 test accuracy = 0.8815 train MAE = 3.0558km test MAE = 3.1493km
Epoch: 4 loss = 0.63352144 train accuracy = 0.8991 test accuracy = 0.8827 train MAE = 2.6213km test MAE = 3.1267km
Epoch: 5 loss = 0.61497533 train accuracy = 0.9128 test accuracy = 0.8827 train MAE = 2.1735km test MAE = 3.1937km
Epoch: 6 loss = 0.59397072 train accuracy = 0.9256 test accuracy = 0.8862 train MAE = 1.7447km test MAE = 3.0591km
Epoch: 7 loss = 0.56800884 train accuracy = 0.9375 test accuracy = 0.8867 train MAE = 1.3793km test MAE = 3.0429km
Epoch: 8 loss = 0.53435802 train accuracy = 0.9479 test accuracy = 0.8828 train MAE = 1.0638km test MAE = 3.1927km
Epoch: 9 loss = 0.49114865 train accuracy = 0.9579 test accuracy = 0.8798 train MAE = 0.7921km test MAE = 3.3016km
Epoch: 10 loss = 0.44306010 train accuracy = 0.9650 test accuracy = 0.8757 train MAE = 0.6488km test MAE = 3.4396km
Epoch: 11 loss = 0.39586896 train accuracy = 0.9701 test accuracy = 0.8678 train MAE = 0.5662km test MAE = 3.7822km
Epoch: 12 loss = 0.35276729 train accuracy = 0.9730 test accuracy = 0.8640 train MAE = 0.5570km test MAE = 3.8866km
Epoch: 13 loss = 0.31913051 train accuracy = 0.9743 test accuracy = 0.8555 train MAE = 0.5691km test MAE = 4.2228km
Epoch: 14 loss = 0.29366136 train accuracy = 0.9735 test accuracy = 0.8436 train MAE = 0.6253km test MAE = 4.7506km
Epoch: 15 loss = 0.27878830 train accuracy = 0.9719 test accuracy = 0.8283 train MAE = 0.6998km test MAE = 5.3637km
Epoch: 16 loss = 0.27260813 train accuracy = 0.9679 test accuracy = 0.8298 train MAE = 0.8190km test MAE = 5.0715km
Epoch: 17 loss = 0.27904162 train accuracy = 0.9601 test accuracy = 0.8103 train MAE = 1.0680km test MAE = 5.7339km
Epoch: 18 loss = 0.31042713 train accuracy = 0.9444 test accuracy = 0.8078 train MAE = 1.5645km test MAE = 5.7984km
Epoch: 19 loss = 0.37315172 train accuracy = 0.9154 test accuracy = 0.7797 train MAE = 2.4315km test MAE = 6.6885km
Epoch: 20 loss = 0.42424229 train accuracy = 0.8734 test accuracy = 0.7663 train MAE = 3.7755km test MAE = 6.9680km
Learning Finished! It took 5:20:45.