Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1, 6000, 3)] 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1, 6000, 64)  832         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1, 6000, 64)  16448       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 1, 3000, 64)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1, 3000, 128) 32896       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 1, 3000, 128) 65664       conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 1500, 128) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1, 1500, 256) 131328      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 1500, 256) 262400      conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 1, 750, 256)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 1, 750, 512)  524800      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 750, 512)  1049088     conv2d_6[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1, 750, 512)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 375, 512)  0           dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 375, 1024) 2098176     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 1, 375, 1024) 4195328     conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1, 375, 1024) 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 1, 750, 1024) 0           dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 1, 750, 512)  2097664     up_sampling2d[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1, 750, 1024) 0           dropout[0][0]                    
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 1, 750, 512)  2097664     concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 1, 750, 512)  1049088     conv2d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 1, 1500, 512) 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1, 1500, 256) 524544      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 1500, 512) 0           conv2d_5[0][0]                   
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 1, 1500, 256) 524544      concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 1, 1500, 256) 262400      conv2d_14[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 1, 3000, 256) 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 1, 3000, 128) 131200      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1, 3000, 256) 0           conv2d_3[0][0]                   
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 1, 3000, 128) 131200      concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 1, 3000, 128) 65664       conv2d_17[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 1, 6000, 128) 0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 1, 6000, 64)  32832       up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1, 6000, 128) 0           conv2d_1[0][0]                   
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 1, 6000, 64)  32832       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 1, 6000, 64)  16448       conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 1, 6000, 2)   514         conv2d_21[0][0]                  
__________________________________________________________________________________________________
flatten (Flatten)               (None, 12000)        0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         12289024    flatten[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1024)         0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 101)          103525      dropout_2[0][0]                  
==================================================================================================
Total params: 27,736,103
Trainable params: 27,736,103
Non-trainable params: 0
__________________________________________________________________________________________________
model info save COMPLETE!
Total data number is 101437, Data processing took 0:00:55.
learning rate = 0.0001 epoch = 13
Learning started. It takes sometime.
4 randomly selected traindata index : [75428, 59258, 67851, 7895]
4 randomly selected testdata index : [12961, 10685, 16504, 6911]
Epoch: 1 loss = 0.71786618 train MAE = 4.4452km test MAE = 3.7733km
Epoch: 2 loss = 0.67410815 train MAE = 3.4428km test MAE = 3.6244km
Epoch: 3 loss = 0.65149510 train MAE = 3.0290km test MAE = 3.1474km
Epoch: 4 loss = 0.63253200 train MAE = 2.5841km test MAE = 3.1518km
Epoch: 5 loss = 0.61370051 train MAE = 2.1060km test MAE = 3.1597km
Epoch: 6 loss = 0.59219104 train MAE = 1.6661km test MAE = 3.0991km
Epoch: 7 loss = 0.56630945 train MAE = 1.3041km test MAE = 3.1636km
Epoch: 8 loss = 0.53132409 train MAE = 1.0027km test MAE = 3.2538km
Epoch: 9 loss = 0.48789197 train MAE = 0.7597km test MAE = 3.3445km
Epoch: 10 loss = 0.43711141 train MAE = 0.6277km test MAE = 3.6338km
Epoch: 11 loss = 0.38675457 train MAE = 0.5357km test MAE = 3.8566km
Epoch: 12 loss = 0.34396896 train MAE = 0.5566km test MAE = 3.8379km
Epoch: 13 loss = 0.31017169 train MAE = 0.5797km test MAE = 4.4337km
Learning Finished! It took 3:24:19.