Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 1, 6000, 32)       416       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 3000, 32)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 1, 3000, 64)       8256      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 1500, 64)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 1500, 128)      32896     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 750, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 750, 256)       131328    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 375, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 96000)             0         
_________________________________________________________________
dense (Dense)                (None, 1024)              98305024  
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 101)               103525    
=================================================================
Total params: 98,581,445
Trainable params: 98,581,445
Non-trainable params: 0
_________________________________________________________________
model info save COMPLETE!
Total data number is 101437, Data processing took 0:00:54.
learning rate = 0.0001 epoch = 8
Learning started. It takes sometime.
Epoch: 1 loss = 0.71670943 train MAE = 4.5217km test MAE = 3.9152km
Epoch: 2 loss = 0.64319694 train MAE = 2.6827km test MAE = 3.4199km
Epoch: 3 loss = 0.54795885 train MAE = 0.9203km test MAE = 3.2001km
Epoch: 4 loss = 0.43695089 train MAE = 0.2656km test MAE = 3.2494km
Epoch: 5 loss = 0.33018818 train MAE = 0.0753km test MAE = 3.3642km
Epoch: 6 loss = 0.25270167 train MAE = 0.0317km test MAE = 3.4889km
Epoch: 7 loss = 0.20301454 train MAE = 0.0218km test MAE = 3.7023km
Epoch: 8 loss = 0.16990711 train MAE = 0.0208km test MAE = 3.8024km
Learning Finished! It took 0:29:34.