Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 1, 6000, 32)       416       
_________________________________________________________________
batch_normalization (BatchNo (None, 1, 6000, 32)       128       
_________________________________________________________________
activation (Activation)      (None, 1, 6000, 32)       0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 3000, 32)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 1, 3000, 64)       8256      
_________________________________________________________________
batch_normalization_1 (Batch (None, 1, 3000, 64)       256       
_________________________________________________________________
activation_1 (Activation)    (None, 1, 3000, 64)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 1500, 64)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 1500, 128)      32896     
_________________________________________________________________
batch_normalization_2 (Batch (None, 1, 1500, 128)      512       
_________________________________________________________________
activation_2 (Activation)    (None, 1, 1500, 128)      0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 750, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 750, 256)       131328    
_________________________________________________________________
batch_normalization_3 (Batch (None, 1, 750, 256)       1024      
_________________________________________________________________
activation_3 (Activation)    (None, 1, 750, 256)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 375, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 96000)             0         
_________________________________________________________________
dense (Dense)                (None, 1024)              98305024  
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 101)               103525    
=================================================================
Total params: 98,583,365
Trainable params: 98,582,405
Non-trainable params: 960
_________________________________________________________________
