Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 1, 6000, 32)       416       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 3000, 32)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 1, 3000, 64)       8256      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 1500, 64)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 1500, 128)      32896     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 750, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 750, 256)       131328    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 375, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 96000)             0         
_________________________________________________________________
dense (Dense)                (None, 1024)              98305024  
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 101)               103525    
=================================================================
Total params: 98,581,445
Trainable params: 98,581,445
Non-trainable params: 0
_________________________________________________________________
model info save COMPLETE!
Total data number is 101437, Data processing took 0:00:41.
learning rate = 0.0001 epoch = 8
Learning started. It takes sometime.
4 randomly selected traindata index : [15622, 64905, 6165, 71802]4 randomly selected testdata index : [4860, 306, 9700, 6387]Epoch: 1 loss = 0.71658099 train MAE = 4.5453km test MAE = 4.1134km
Epoch: 2 loss = 0.64406103 train MAE = 2.6957km test MAE = 3.4968km
Epoch: 3 loss = 0.54935539 train MAE = 0.9468km test MAE = 3.2730km
Epoch: 4 loss = 0.43763342 train MAE = 0.2811km test MAE = 3.3066km
Epoch: 5 loss = 0.33001864 train MAE = 0.0817km test MAE = 3.3992km
Epoch: 6 loss = 0.25143597 train MAE = 0.0339km test MAE = 3.5338km
Epoch: 7 loss = 0.20184405 train MAE = 0.0244km test MAE = 3.7689km
Epoch: 8 loss = 0.16833191 train MAE = 0.0259km test MAE = 3.8571km
Learning Finished! It took 0:29:07.