Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 1, 6000, 32)       416       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 3000, 32)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 1, 3000, 64)       8256      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 1500, 64)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 1500, 128)      32896     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 750, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 750, 256)       131328    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 375, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 96000)             0         
_________________________________________________________________
dense (Dense)                (None, 1024)              98305024  
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 101)               103525    
=================================================================
Total params: 98,581,445
Trainable params: 98,581,445
Non-trainable params: 0
_________________________________________________________________
model info save COMPLETE!
Total data number is 101437, Data processing took 0:00:53.
learning rate = 0.0001 epoch = 8
Learning started. It takes sometime.
Epoch: 1 loss = 0.71639347 train MAE = 4.5285km test MAE = 3.9675km
Epoch: 2 loss = 0.64333922 train MAE = 2.6684km test MAE = 3.4194km
Epoch: 3 loss = 0.54671711 train MAE = 0.9171km test MAE = 3.2918km
Epoch: 4 loss = 0.43236753 train MAE = 0.2727km test MAE = 3.2765km
Epoch: 5 loss = 0.32542035 train MAE = 0.0792km test MAE = 3.3238km
Epoch: 6 loss = 0.24876177 train MAE = 0.0372km test MAE = 3.5343km
Epoch: 7 loss = 0.20012252 train MAE = 0.0266km test MAE = 3.6880km
Epoch: 8 loss = 0.16675070 train MAE = 0.0216km test MAE = 3.8763km
Learning Finished! It took 0:27:25.