Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1, 6000, 3)] 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1, 6000, 64)  832         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1, 6000, 64)  16448       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 1, 3000, 64)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1, 3000, 128) 32896       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 1, 3000, 128) 65664       conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 1500, 128) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1, 1500, 256) 131328      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 1500, 256) 262400      conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 1, 750, 256)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 1, 750, 512)  524800      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 750, 512)  1049088     conv2d_6[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1, 750, 512)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 375, 512)  0           dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 375, 1024) 2098176     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 1, 375, 1024) 4195328     conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1, 375, 1024) 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 1, 750, 1024) 0           dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 1, 750, 512)  2097664     up_sampling2d[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1, 750, 1024) 0           dropout[0][0]                    
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 1, 750, 512)  2097664     concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 1, 750, 512)  1049088     conv2d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 1, 1500, 512) 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1, 1500, 256) 524544      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 1500, 512) 0           conv2d_5[0][0]                   
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 1, 1500, 256) 524544      concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 1, 1500, 256) 262400      conv2d_14[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 1, 3000, 256) 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 1, 3000, 128) 131200      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1, 3000, 256) 0           conv2d_3[0][0]                   
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 1, 3000, 128) 131200      concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 1, 3000, 128) 65664       conv2d_17[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 1, 6000, 128) 0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 1, 6000, 64)  32832       up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1, 6000, 128) 0           conv2d_1[0][0]                   
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 1, 6000, 64)  32832       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 1, 6000, 64)  16448       conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 1, 6000, 2)   514         conv2d_21[0][0]                  
__________________________________________________________________________________________________
flatten (Flatten)               (None, 12000)        0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         12289024    flatten[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1024)         0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1001)         1026025     dropout_2[0][0]                  
==================================================================================================
Total params: 28,658,603
Trainable params: 28,658,603
Non-trainable params: 0
__________________________________________________________________________________________________
model info save COMPLETE!
Total data number is 101437, Data processing took 0:00:38.
learning rate = 0.001 epoch = 20
Learning started. It takes sometime.
Epoch: 1 loss = 0.96542013 train MAE = 19.0523km test MAE = 17.9203km
Epoch: 2 loss = 0.96470749 train MAE = 18.7535km test MAE = 17.9203km
Epoch: 3 loss = 0.96458822 train MAE = 18.8705km test MAE = 17.9203km
Epoch: 4 loss = 0.96451455 train MAE = 18.2029km test MAE = 18.1398km
Epoch: 5 loss = 0.96447545 train MAE = 18.2823km test MAE = 19.9223km
Epoch: 6 loss = 0.96446067 train MAE = 18.6162km test MAE = 19.6313km
Epoch: 7 loss = 0.96444482 train MAE = 18.6113km test MAE = 17.9203km
Epoch: 8 loss = 0.96443558 train MAE = 18.4759km test MAE = 17.9203km
Epoch: 9 loss = 0.96442389 train MAE = 18.5069km test MAE = 17.9203km
Epoch: 10 loss = 0.96441209 train MAE = 18.6481km test MAE = 19.8469km
Epoch: 11 loss = 0.96440589 train MAE = 18.4366km test MAE = 17.9203km
Epoch: 12 loss = 0.96440929 train MAE = 18.3126km test MAE = 17.9203km
Epoch: 13 loss = 0.96438420 train MAE = 18.4501km test MAE = 17.9203km
Epoch: 14 loss = 0.96440035 train MAE = 18.6797km test MAE = 17.9203km
Epoch: 15 loss = 0.96439350 train MAE = 18.2418km test MAE = 17.9203km
Epoch: 16 loss = 0.96437854 train MAE = 18.1437km test MAE = 17.9203km
Epoch: 17 loss = 0.96437520 train MAE = 18.6135km test MAE = 17.9203km
Epoch: 18 loss = 0.96439219 train MAE = 18.4519km test MAE = 19.9223km
Epoch: 19 loss = 0.96437323 train MAE = 18.8956km test MAE = 17.9203km
Epoch: 20 loss = 0.96437055 train MAE = 18.3413km test MAE = 17.9203km
Learning Finished! It took 5:17:58.